Repository: Kous92/SuperNews-V2-iOS-UIKit
Catalog: SuperNewsV2UIKit/SuperNewsV2UIKit/Resources/Localizable.xcstrings
Source language: en
Languages: fr

source: All sources
fr: Toutes les sources

# apiError
source: An error has occurred.
fr: Une erreur est survenue.

source: Arabic
fr: Arabe

source: Article website
fr: Site web de l'article

source: Back
fr: Retour

source: By category
fr: Par catégorie

source: By country
fr: Par pays

source: By language
fr: Par langue

source: Cancel
fr: Annuler

source: Category
fr: Catégorie

source: Chinese
fr: Chinois

source: Country
fr: Pays

# decodeDownloadError
source: An error has occurred when decoding downloaded data.
fr: Une erreur est survenue au décodage des données téléchargées.

# decodeSavingError
source: An error has occurred when decoding loaded data.
fr: Une erreur est survenue au décodage des données chargées.

# deniedError
source: You have refused access to the location service. Please authorize it by going to Settings > Privacy & Security > Location Services > SuperNews.
fr: Vous avez refusé l'accès au service de localisation. Merci de l'autoriser en allant dans Réglages > Confidentialité > Service de localisation > SuperNews.

# differentCountryMessageAlert1
source: You are located in a country
fr: Vous êtes localisé dans un pays

# differentCountryMessageAlert2
source: which is not available on the map. The nearest country suggested is:
fr: qui n'est pas disponible sur la carte. Le pays le plus proche qui est suggéré est:

# differentCountryMessageAlert3
source: Would you like to center the map on the source of the suggested country ? Otherwise, the map will be centered on your current position.
fr: Voulez-vous centrer la carte sur la source du pays suggéré ? Sinon, la carte sera centrée sur votre position actuelle.

# downloadError
source: An error has occurred while downloading data.
fr: Une erreur est survenue au téléchargement des données.

source: Dutch
fr: Néerlandais

# encodeSavingError
source: An error has occurred when encoding data before saving.
fr: Une erreur est survenue à l'encodage des données avant sauvegarde.

source: English
fr: Anglais

source: Entertainment
fr: Divertissement

source: Error
fr: Erreur

# errorOccurred
source: An error has occurred
fr: Une erreur est survenue.

source: French
fr: Français

source: General
fr: Général

source: German
fr: Allemand

# gpsServiceNotAvailableError
source: Location service unavailable. Make sure GPS signal is available by checking permissions in Settings > Privacy & Security > Location Services > SuperNews.
fr: Service de localisation indisponible. Assurez-vous que le signal GPS soit disponible en vérifiant les autorisations dans Réglages > Confidentialité > Service de localisation > SuperNews.

source: Health
fr: Santé

source: Hebrew
fr: Hébreu

# invalidApiKey
source: Erreur 401: The API key is invalid or missing.
fr: Erreur 401: La clé d'API est invalide ou inexistante.

# invalidURL
source: Error: Invalid URL
fr: Erreur: URL invalide

source: Italian
fr: Italien

source: language
fr: langue

# language1
source: Language
fr: Langue

# loadingError
source: An error has occurred when loading the setting.
fr: Une erreur est survenue au chargement du paramètre.

# localFileError
source: File does not exists.
fr: Le fichier n'existe pas.

source: Local news
fr: Actualités locales

# mediaNews
source: News from media:
fr: Actualités du média:

source: Media source name
fr: Nom du média source

source: Media URL
fr: URL du média

# networkError
source: No Internet connection.
fr: Pas de connexion Internet.

# news
source: Top headlines
fr: Actualités

source: News country
fr: Pays des news

source: News language
fr: Langue des news

# newsReset
source: Reset settings
fr: Réinitialiser les paramètres

source: No
fr: Non

source: No article available
fr: Aucun article disponible

source: No available content
fr: Aucun contenu disponible

# noCountries
source: No country available
fr: Aucun pays disponible

source: No description
fr: Aucune description

source: No result found for
fr: Aucun résultat pour

source: Norwegian
fr: Norvégien

# noSourceFound
source: No source found with
fr: Aucune source trouvée avec

# notFound
source: Error 404: No content available.
fr: Erreur 404: Aucun contenu disponible.

# NSLocationWhenInUseUsageDescription
source: In order to use the world map with best experience and suggestion, allow the app the access of location service to place you on the map and suggest you the country to center on the map.
fr: Afin d'utiliser la carte du monde avec la meilleure expérience et suggestion, autorisez l'accès au service de localisation pour vous placer sur la carte et vous suggérer le pays à centrer sur la carte.

# parametersMissing
source: Error 400: Missing parameters in the request.
fr: Erreur 400: Paramètres manquants dans la requête.

# pleaseTryOtherSearch
source: Please try with an other search
fr: Veuillez réessayer avec une autre recherche

source: Portuguese
fr: Portugais

# resetSettingsAlertMessage
source: Do you want to reset all of the news settings ? If yes, all settings will be reset to default.
fr: Voulez-vous réinitialiser tous les paramètres de news ? Si oui, tous les paramètres seront réinitialisés par défaut.

# restrictedError
source: Access to location services is restricted by parental control.
fr: L'accès au service de localisation est restreint par le contrôle parental.

# reverseGeocodingError
source: The country where you are located is unknown.
fr: Le pays où vous êtes localisé est inconnu.

source: Russian
fr: Russe

# sameCountryAlertMessage1
source: You are located in the same country as shown on the map, here:
fr: Vous êtes localisé dans le même pays que celui est disponible sur la carte, ici:

# sameCountryAlertMessage2
source: Do you want to center the map on the country source? Otherwise, the map will be centered on your current position.
fr: Voulez-vous centrer la carte sur la source du pays ? Sinon, la carte sera centrée sur votre position actuelle.

# savingError
source: An error has occurred when saving the setting.
fr: Une erreur est survenue à la sauvegarde du paramètre.

source: Search
fr: Recherche

# serverError
source: Error 500: Server error.
fr: Error 500: Erreur serveur.

source: Settings
fr: Paramètres

# sourceNews
source: News from source
fr: Actualités d'une source

source: Source selection
fr: Choix de la source

source: Spanish
fr: Espagnol

source: Swedish
fr: Suédois

source: Technology
fr: Technologie

# tooManyRequests
source: Error 429: Too many requests within a window of time. Please try again later.
fr: Erreur 429: Trop de requêtes ont été effectuées dans un laps de temps. Veuillez réessayer ultérieurement.

source: Unknown author
fr: Auteur inconnu

source: Unknown date
fr: Date inconnue

source: Unknown error
fr: Erreur inconnue

source: Unknown source
fr: Source inconnue

source: Urdu
fr: Ourdou

source: Warning
fr: Attention

source: World map
fr: Carte du monde

source: Yes
fr: Oui
